Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.pairPrompt
source: # Pair Starcat CLI ## Goal The current AI Agent uses the complete single-use pairing command generated by Starcat, then waits for the user to approve the device in Starcat. ## Single-Use Pairing Command ```bash %1$@ ``` ## Steps 1. Confirm that the content above is one complete `starcat pair ...` command. 2. Execute the complete command exactly as provided. Do not edit or split its URI or arguments. 3. If the CLI starts waiting for approval, instruct the user to return to Starcat. 4. The user reviews the device information and approves pairing in Starcat. 5. After pairing succeeds, run: ```bash starcat doctor ``` 6. If the current macOS/Linux shell cannot find `starcat`, use: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Error Handling ### Expired command Instruct the user to generate and copy a new pairing prompt from **Starcat > Settings > MCP Service**. ### Already-used command Instruct the user to generate a new single-use pairing command. Do not retry an already-used command. ### Pairing rejected by the user Stop and report that the device did not receive Starcat access. ### Starcat is not running Instruct the user to launch Starcat and enable MCP Service, then run diagnostics again. ## Security Boundaries - Do not parse, edit, or split the pairing URI. - Do not repeat the complete pairing command in the final response. - Do not store the pairing command in a repository, configuration file, note, or persistent log. - Do not reuse a completed or expired pairing command. - Do not request a Local API Key. - Do not manually downgrade an HTTPS endpoint to HTTP. - Do not run other Starcat commands before pairing completes. ## Final Report The current AI Agent reports: - Whether the CLI accepted the pairing command - Whether it entered the Starcat approval stage - Whether the user approved the device - Whether `starcat doctor` is healthy - CLI version, App version, and available tool count The final report must not contain the complete pairing command, pairing URI, secret, or other credentials.
ar: # اقتران Starcat CLI ## الهدف يستخدم وكيل الذكاء الاصطناعي الحالي أمر الاقتران الكامل للاستخدام مرة واحدة الذي تم إنشاؤه بواسطة Starcat، ثم ينتظر موافقة المستخدم على الجهاز في Starcat. ## أمر الاقتران للاستخدام مرة واحدة ```bash %1$@ ``` ## الخطوات 1. أكد أن المحتوى أعلاه هو أمر `starcat pair ...` كامل واحد. 2. نفذ الأمر الكامل تمامًا كما هو مقدم. لا تقم بتحرير أو تقسيم URI أو وسائطه. 3. إذا بدأ CLI في انتظار الموافقة، اطلب من المستخدم العودة إلى Starcat. 4. يراجع المستخدم معلومات الجهاز ويوافق على الاقتران في Starcat. 5. بعد نجاح الاقتران، شغّل: ```bash starcat doctor ``` 6. إذا لم تتمكن جلسة macOS/Linux الحالية من العثور على `starcat`، استخدم: ```bash "$HOME/.local/bin/starcat" doctor ``` ## معالجة الأخطاء ### أمر منتهي الصلاحية اطلب من المستخدم إنشاء ونسخ مطالبة اقتران جديدة من **Starcat > الإعدادات > خدمة MCP**. ### أمر مستخدم بالفعل اطلب من المستخدم إنشاء أمر اقتران جديد للاستخدام مرة واحدة. لا تعاود المحاولة بأمر مستخدم بالفعل. ### رفض الاقتران من قبل المستخدم توقف وأبلغ أن الجهاز لم يتلق وصول Starcat. ### Starcat لا يعمل اطلب من المستخدم تشغيل Starcat وتمكين خدمة MCP، ثم تشغيل التشخيص مرة أخرى. ## حدود الأمان - لا تقم بتحليل أو تحرير أو تقسيم URI الاقتران. - لا تكرر أمر الاقتران الكامل في الرد النهائي. - لا تخزن أمر الاقتران في مستودع أو ملف تكوين أو ملاحظة أو سجل دائم. - لا تعيد استخدام أمر اقتران مكتمل أو منتهي الصلاحية. - لا تطلب مفتاح API محلي. - لا تقم يدويًا بتخفيض نقطة نهاية HTTPS إلى HTTP. - لا تشغل أوامر Starcat أخرى قبل اكتمال الاقتران. ## التقرير النهائي يبلغ وكيل الذكاء الاصطناعي الحالي: - ما إذا قبل CLI أمر الاقتران - ما إذا دخل مرحلة موافقة Starcat - ما إذا وافق المستخدم على الجهاز - ما إذا كان `starcat doctor` سليمًا - إصدار CLI وإصدار التطبيق وعدد الأدوات المتاحة يجب ألا يحتوي التقرير النهائي على أمر الاقتران الكامل أو URI الاقتران أو السر أو أي اعتمادات أخرى.
de: # Starcat CLI paaren ## Ziel Der aktuelle KI-Agent verwendet den vollständigen, einmaligen Pairing-Befehl, der von Starcat generiert wurde, und wartet dann darauf, dass der Benutzer das Gerät in Starcat genehmigt. ## Einmaliger Pairing-Befehl ```bash %1$@ ``` ## Schritte 1. Bestätigen Sie, dass der obige Inhalt ein vollständiger `starcat pair ...`-Befehl ist. 2. Führen Sie den vollständigen Befehl genau wie angegeben aus. Bearbeiten oder teilen Sie seinen URI oder seine Argumente nicht. 3. Wenn die CLI auf die Genehmigung wartet, weisen Sie den Benutzer an, zu Starcat zurückzukehren. 4. Der Benutzer überprüft die Geräteinformationen und genehmigt das Pairing in Starcat. 5. Nach erfolgreichem Pairing führen Sie aus: ```bash starcat doctor ``` 6. Wenn die aktuelle macOS/Linux-Shell `starcat` nicht finden kann, verwenden Sie: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Fehlerbehandlung ### Abgelaufener Befehl Weisen Sie den Benutzer an, einen neuen Pairing-Prompt aus **Starcat > Einstellungen > MCP-Dienst** zu generieren und zu kopieren. ### Bereits verwendeter Befehl Weisen Sie den Benutzer an, einen neuen einmaligen Pairing-Befehl zu generieren. Versuchen Sie keinen bereits verwendeten Befehl erneut. ### Vom Benutzer abgelehntes Pairing Stoppen Sie und melden Sie, dass das Gerät keinen Starcat-Zugriff erhalten hat. ### Starcat läuft nicht Weisen Sie den Benutzer an, Starcat zu starten und den MCP-Dienst zu aktivieren, und führen Sie dann die Diagnose erneut aus. ## Sicherheitsgrenzen - Parsen, bearbeiten oder teilen Sie den Pairing-URI nicht. - Wiederholen Sie den vollständigen Pairing-Befehl nicht in der endgültigen Antwort. - Speichern Sie den Pairing-Befehl nicht in einem Repository, einer Konfigurationsdatei, einer Notiz oder einem dauerhaften Protokoll. - Verwenden Sie keinen abgeschlossenen oder abgelaufenen Pairing-Befehl erneut. - Fordern Sie keinen lokalen API-Schlüssel an. - Stufen Sie einen HTTPS-Endpunkt nicht manuell auf HTTP herab. - Führen Sie vor Abschluss des Pairings keine anderen Starcat-Befehle aus. ## Abschlussbericht Der aktuelle KI-Agent berichtet: - Ob die CLI den Pairing-Befehl akzeptiert hat - Ob sie die Starcat-Genehmigungsphase erreicht hat - Ob der Benutzer das Gerät genehmigt hat - Ob `starcat doctor` gesund ist - CLI-Version, App-Version und Anzahl der verfügbaren Tools Der Abschlussbericht darf den vollständigen Pairing-Befehl, Pairing-URI, Geheimnis oder andere Anmeldeinformationen nicht enthalten.
es: # Emparejar CLI de Starcat ## Objetivo El agente de IA actual usa el comando de emparejamiento de un solo uso generado por Starcat y luego espera a que el usuario apruebe el dispositivo en Starcat. ## Comando de emparejamiento de un solo uso ```bash %1$@ ``` ## Pasos 1. Confirma que el contenido anterior es un comando `starcat pair ...` completo. 2. Ejecuta el comando completo exactamente como se proporciona. No edites ni dividas su URI o argumentos. 3. Si la CLI comienza a esperar aprobación, indica al usuario que regrese a Starcat. 4. El usuario revisa la información del dispositivo y aprueba el emparejamiento en Starcat. 5. Después de que el emparejamiento sea exitoso, ejecuta: ```bash starcat doctor ``` 6. Si el shell actual de macOS/Linux no puede encontrar `starcat`, usa: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Manejo de errores ### Comando caducado Indica al usuario que genere y copie una nueva indicación de emparejamiento desde **Starcat > Ajustes > Servicio MCP**. ### Comando ya usado Indica al usuario que genere un nuevo comando de emparejamiento de un solo uso. No reintentes un comando ya usado. ### Emparejamiento rechazado por el usuario Detente e informa que el dispositivo no recibió acceso a Starcat. ### Starcat no está ejecutándose Indica al usuario que inicie Starcat y habilite el servicio MCP, luego ejecuta el diagnóstico nuevamente. ## Límites de seguridad - No analices, edites ni dividas el URI de emparejamiento. - No repitas el comando de emparejamiento completo en la respuesta final. - No almacenes el comando de emparejamiento en un repositorio, archivo de configuración, nota o registro persistente. - No reutilices un comando de emparejamiento completado o caducado. - No solicites una clave API local. - No degrades manualmente un endpoint HTTPS a HTTP. - No ejecutes otros comandos de Starcat antes de que se complete el emparejamiento. ## Informe final El agente de IA actual informa: - Si la CLI aceptó el comando de emparejamiento - Si entró en la etapa de aprobación de Starcat - Si el usuario aprobó el dispositivo - Si `starcat doctor` está saludable - Versión de la CLI, versión de la aplicación y número de herramientas disponibles El informe final no debe contener el comando de emparejamiento completo, URI de emparejamiento, secreto u otras credenciales.
fr: # Appairer la CLI Starcat ## Objectif L'agent IA actuel utilise la commande d'appairage à usage unique complète générée par Starcat, puis attend que l'utilisateur approuve l'appareil dans Starcat. ## Commande d'appairage à usage unique ```bash %1$@ ``` ## Étapes 1. Confirmez que le contenu ci-dessus est une commande `starcat pair ...` complète. 2. Exécutez la commande complète exactement comme fournie. Ne modifiez pas son URI ou ses arguments. 3. Si la CLI commence à attendre l'approbation, demandez à l'utilisateur de revenir à Starcat. 4. L'utilisateur examine les informations de l'appareil et approuve l'appairage dans Starcat. 5. Après la réussite de l'appairage, exécutez : ```bash starcat doctor ``` 6. Si le shell macOS/Linux actuel ne trouve pas `starcat`, utilisez : ```bash "$HOME/.local/bin/starcat" doctor ``` ## Gestion des erreurs ### Commande expirée Demandez à l'utilisateur de générer et copier une nouvelle invite d'appairage depuis **Starcat > Réglages > Service MCP**. ### Commande déjà utilisée Demandez à l'utilisateur de générer une nouvelle commande d'appairage à usage unique. Ne réessayez pas une commande déjà utilisée. ### Appairage rejeté par l'utilisateur Arrêtez-vous et signalez que l'appareil n'a pas reçu l'accès à Starcat. ### Starcat n'est pas en cours d'exécution Demandez à l'utilisateur de lancer Starcat et d'activer le service MCP, puis exécutez à nouveau les diagnostics. ## Limites de sécurité - N'analysez pas, ne modifiez pas et ne divisez pas l'URI d'appairage. - Ne répétez pas la commande d'appairage complète dans la réponse finale. - Ne stockez pas la commande d'appairage dans un dépôt, un fichier de configuration, une note ou un journal persistant. - Ne réutilisez pas une commande d'appairage terminée ou expirée. - Ne demandez pas de clé API locale. - Ne rétrogradez pas manuellement un point de terminaison HTTPS en HTTP. - N'exécutez pas d'autres commandes Starcat avant la fin de l'appairage. ## Rapport final L'agent IA actuel rapporte : - Si la CLI a accepté la commande d'appairage - Si elle est entrée dans l'étape d'approbation Starcat - Si l'utilisateur a approuvé l'appareil - Si `starcat doctor` est sain - Version de la CLI, version de l'application et nombre d'outils disponibles Le rapport final ne doit pas contenir la commande d'appairage complète, l'URI d'appairage, le secret ou d'autres informations d'identification.
id: # Pasangkan Starcat CLI ## Tujuan Agen AI saat ini menggunakan perintah pemasangan sekali pakai lengkap yang dihasilkan oleh Starcat, lalu menunggu pengguna menyetujui perangkat di Starcat. ## Perintah Pemasangan Sekali Pakai ```bash %1$@ ``` ## Langkah-langkah 1. Konfirmasi bahwa konten di atas adalah satu perintah `starcat pair ...` yang lengkap. 2. Jalankan perintah lengkap persis seperti yang diberikan. Jangan mengedit atau membagi URI atau argumennya. 3. Jika CLI mulai menunggu persetujuan, instruksikan pengguna untuk kembali ke Starcat. 4. Pengguna meninjau informasi perangkat dan menyetujui pemasangan di Starcat. 5. Setelah pemasangan berhasil, jalankan: ```bash starcat doctor ``` 6. Jika shell macOS/Linux saat ini tidak dapat menemukan `starcat`, gunakan: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Penanganan Kesalahan ### Perintah kedaluwarsa Instruksikan pengguna untuk membuat dan menyalin prompt pemasangan baru dari **Starcat > Pengaturan > Layanan MCP**. ### Perintah sudah digunakan Instruksikan pengguna untuk membuat perintah pemasangan sekali pakai baru. Jangan mencoba ulang perintah yang sudah digunakan. ### Pemasangan ditolak oleh pengguna Berhenti dan laporkan bahwa perangkat tidak menerima akses Starcat. ### Starcat tidak berjalan Instruksikan pengguna untuk meluncurkan Starcat dan mengaktifkan Layanan MCP, lalu jalankan diagnostik lagi. ## Batasan Keamanan - Jangan mengurai, mengedit, atau membagi URI pemasangan. - Jangan mengulangi perintah pemasangan lengkap dalam respons akhir. - Jangan menyimpan perintah pemasangan di repositori, file konfigurasi, catatan, atau log persisten. - Jangan menggunakan kembali perintah pemasangan yang sudah selesai atau kedaluwarsa. - Jangan meminta Kunci API Lokal. - Jangan menurunkan endpoint HTTPS ke HTTP secara manual. - Jangan menjalankan perintah Starcat lain sebelum pemasangan selesai. ## Laporan Akhir Agen AI saat ini melaporkan: - Apakah CLI menerima perintah pemasangan - Apakah memasuki tahap persetujuan Starcat - Apakah pengguna menyetujui perangkat - Apakah `starcat doctor` sehat - Versi CLI, versi Aplikasi, dan jumlah alat yang tersedia Laporan akhir tidak boleh berisi perintah pemasangan lengkap, URI pemasangan, rahasia, atau kredensial lainnya.
it: # Abbina CLI Starcat ## Obiettivo L'agente AI corrente utilizza il comando di abbinamento monouso completo generato da Starcat, quindi attende che l'utente approvi il dispositivo in Starcat. ## Comando di abbinamento monouso ```bash %1$@ ``` ## Passaggi 1. Conferma che il contenuto sopra sia un comando `starcat pair ...` completo. 2. Esegui il comando completo esattamente come fornito. Non modificare o suddividere il suo URI o i suoi argomenti. 3. Se la CLI inizia ad attendere l'approvazione, indica all'utente di tornare a Starcat. 4. L'utente esamina le informazioni del dispositivo e approva l'abbinamento in Starcat. 5. Dopo che l'abbinamento è riuscito, esegui: ```bash starcat doctor ``` 6. Se la shell corrente macOS/Linux non trova `starcat`, usa: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Gestione errori ### Comando scaduto Indica all'utente di generare e copiare un nuovo prompt di abbinamento da **Starcat > Impostazioni > Servizio MCP**. ### Comando già utilizzato Indica all'utente di generare un nuovo comando di abbinamento monouso. Non riprovare un comando già utilizzato. ### Abbinamento rifiutato dall'utente Interrompi e segnala che il dispositivo non ha ricevuto l'accesso a Starcat. ### Starcat non è in esecuzione Indica all'utente di avviare Starcat e abilitare il servizio MCP, quindi esegui di nuovo la diagnostica. ## Limiti di sicurezza - Non analizzare, modificare o suddividere l'URI di abbinamento. - Non ripetere il comando di abbinamento completo nella risposta finale. - Non memorizzare il comando di abbinamento in un repository, file di configurazione, nota o registro persistente. - Non riutilizzare un comando di abbinamento completato o scaduto. - Non richiedere una chiave API locale. - Non declassare manualmente un endpoint HTTPS a HTTP. - Non eseguire altri comandi di Starcat prima del completamento dell'abbinamento. ## Report finale L'agente AI corrente segnala: - Se la CLI ha accettato il comando di abbinamento - Se è entrata nella fase di approvazione di Starcat - Se l'utente ha approvato il dispositivo - Se `starcat doctor` è integro - Versione CLI, versione App e numero di strumenti disponibili Il report finale non deve contenere il comando di abbinamento completo, l'URI di abbinamento, il segreto o altre credenziali.
ja: # Starcat CLIのペアリング ## 目標 現在のAIエージェントは、Starcatが生成した完全な単回使用ペアリングコマンドを使用し、ユーザーがStarcatでデバイスを承認するのを待ちます。 ## 単回使用ペアリングコマンド ```bash %1$@ ``` ## 手順 1. 上記の内容が完全な `starcat pair ...` コマンドであることを確認します。 2. 提供された完全なコマンドをそのまま実行します。URIや引数を編集したり分割したりしないでください。 3. CLIが承認待ちになった場合、ユーザーにStarcatに戻るよう指示します。 4. ユーザーはデバイス情報を確認し、Starcatでペアリングを承認します。 5. ペアリングが成功したら、以下を実行します： ```bash starcat doctor ``` 6. 現在のmacOS/Linuxシェルで `starcat` が見つからない場合は、以下を使用します： ```bash "$HOME/.local/bin/starcat" doctor ``` ## エラー処理 ### 期限切れのコマンド ユーザーに **Starcat > 設定 > MCPサービス** から新しいペアリングプロンプトを生成してコピーするよう指示します。 ### 既に使用されたコマンド ユーザーに新しい単回使用ペアリングコマンドを生成するよう指示します。既に使用されたコマンドを再試行しないでください。 ### ユーザーによるペアリング拒否 停止し、デバイスがStarcatアクセスを受け取らなかったことを報告します。 ### Starcatが実行されていない ユーザーにStarcatを起動してMCPサービスを有効にし、再度診断を実行するよう指示します。 ## セキュリティ境界 - ペアリングURIを解析、編集、分割しないでください。 - 最終応答に完全なペアリングコマンドを繰り返さないでください。 - ペアリングコマンドをリポジトリ、設定ファイル、メモ、永続ログに保存しないでください。 - 完了済みまたは期限切れのペアリングコマンドを再利用しないでください。 - ローカルAPIキーを要求しないでください。 - HTTPSエンドポイントを手動でHTTPにダウングレードしないでください。 - ペアリングが完了する前に他のStarcatコマンドを実行しないでください。 ## 最終報告 現在のAIエージェントは以下を報告します： - CLIがペアリングコマンドを受け入れたかどうか - Starcat承認段階に入ったかどうか - ユーザーがデバイスを承認したかどうか - `starcat doctor` が正常かどうか - CLIバージョン、アプリバージョン、利用可能なツール数 最終報告には、完全なペアリングコマンド、ペアリングURI、シークレット、その他の資格情報を含めてはなりません。
ko: # Starcat CLI 페어링 ## 목표 현재 AI 에이전트가 Starcat에서 생성한 완전한 일회용 페어링 명령을 사용한 후 사용자가 Starcat에서 장치를 승인할 때까지 기다립니다. ## 일회용 페어링 명령 ```bash %1$@ ``` ## 단계 1. 위 내용이 하나의 완전한 `starcat pair ...` 명령인지 확인합니다. 2. 제공된 대로 완전한 명령을 정확히 실행합니다. URI나 인수를 편집하거나 분할하지 마십시오. 3. CLI가 승인을 기다리기 시작하면 사용자에게 Starcat으로 돌아가도록 안내합니다. 4. 사용자가 장치 정보를 검토하고 Starcat에서 페어링을 승인합니다. 5. 페어링이 성공한 후 다음을 실행합니다: ```bash starcat doctor ``` 6. 현재 macOS/Linux 셸에서 `starcat`을 찾을 수 없는 경우 다음을 사용하세요: ```bash "$HOME/.local/bin/starcat" doctor ``` ## 오류 처리 ### 만료된 명령 사용자에게 **Starcat > 설정 > MCP 서비스**에서 새 페어링 프롬프트를 생성하고 복사하도록 안내합니다. ### 이미 사용된 명령 사용자에게 새 일회용 페어링 명령을 생성하도록 안내합니다. 이미 사용된 명령을 재시도하지 마십시오. ### 사용자가 페어링 거부 중지하고 장치가 Starcat 액세스 권한을 받지 못했다고 보고합니다. ### Starcat가 실행 중이 아님 사용자에게 Starcat를 실행하고 MCP 서비스를 활성화한 다음 진단을 다시 실행하도록 안내합니다. ## 보안 경계 - 페어링 URI를 구문 분석, 편집 또는 분할하지 마십시오. - 최종 응답에 완전한 페어링 명령을 반복하지 마십시오. - 페어링 명령을 저장소, 구성 파일, 메모 또는 영구 로그에 저장하지 마십시오. - 완료되었거나 만료된 페어링 명령을 재사용하지 마십시오. - 로컬 API 키를 요청하지 마십시오. - HTTPS 엔드포인트를 HTTP로 수동 다운그레이드하지 마십시오. - 페어링이 완료되기 전에 다른 Starcat 명령을 실행하지 마십시오. ## 최종 보고서 현재 AI 에이전트가 보고합니다: - CLI가 페어링 명령을 수락했는지 여부 - Starcat 승인 단계에 진입했는지 여부 - 사용자가 장치를 승인했는지 여부 - `starcat doctor`가 정상인지 여부 - CLI 버전, 앱 버전 및 사용 가능한 도구 수 최종 보고서에는 완전한 페어링 명령, 페어링 URI, 비밀 또는 기타 자격 증명이 포함되어서는 안 됩니다.
nl: # Starcat CLI koppelen ## Doel De huidige AI-agent gebruikt de volledige eenmalige koppelingsopdracht gegenereerd door Starcat en wacht vervolgens tot de gebruiker het apparaat goedkeurt in Starcat. ## Eenmalige koppelingsopdracht ```bash %1$@ ``` ## Stappen 1. Bevestig dat de bovenstaande inhoud één volledige `starcat pair ...`-opdracht is. 2. Voer de volledige opdracht exact uit zoals verstrekt. Bewerk of splits de URI of argumenten niet. 3. Als de CLI wacht op goedkeuring, geef de gebruiker dan de instructie om terug te keren naar Starcat. 4. De gebruiker bekijkt de apparaatinformatie en keurt de koppeling goed in Starcat. 5. Nadat de koppeling is geslaagd, voer je uit: ```bash starcat doctor ``` 6. Als de huidige macOS/Linux-shell `starcat` niet kan vinden, gebruik dan: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Foutafhandeling ### Verlopen opdracht Geef de gebruiker de instructie om een nieuwe koppelingsprompt te genereren en te kopiëren via **Starcat > Instellingen > MCP-service**. ### Al gebruikte opdracht Geef de gebruiker de instructie om een nieuwe eenmalige koppelingsopdracht te genereren. Probeer een al gebruikte opdracht niet opnieuw. ### Koppeling geweigerd door de gebruiker Stop en meld dat het apparaat geen toegang tot Starcat heeft gekregen. ### Starcat is niet actief Geef de gebruiker de instructie om Starcat te starten en MCP-service in te schakelen, en voer vervolgens opnieuw diagnostiek uit. ## Beveiligingsgrenzen - Parseer, bewerk of splits de koppelings-URI niet. - Herhaal de volledige koppelingsopdracht niet in het uiteindelijke antwoord. - Sla de koppelingsopdracht niet op in een repository, configuratiebestand, notitie of permanent logboek. - Gebruik een voltooide of verlopen koppelingsopdracht niet opnieuw. - Vraag niet om een lokale API-sleutel. - Downgrade handmatig geen HTTPS-eindpunt naar HTTP. - Voer geen andere Starcat-opdrachten uit voordat de koppeling is voltooid. ## Eindverslag De huidige AI-agent rapporteert: - Of de CLI de koppelingsopdracht heeft geaccepteerd - Of deze de goedkeuringsfase van Starcat heeft bereikt - Of de gebruiker het apparaat heeft goedgekeurd - Of `starcat doctor` gezond is - CLI-versie, app-versie en beschikbaar aantal tools Het eindverslag mag de volledige koppelingsopdracht, koppelings-URI, geheime sleutel of andere inloggegevens niet bevatten.
pl: # Parowanie Starcat CLI ## Cel Obecny agent AI używa kompletnego jednorazowego polecenia parowania wygenerowanego przez Starcat, a następnie czeka, aż użytkownik zatwierdzi urządzenie w Starcat. ## Jednorazowe polecenie parowania ```bash %1$@ ``` ## Kroki 1. Potwierdź, że powyższa treść jest jednym kompletnym poleceniem `starcat pair ...`. 2. Wykonaj dokładnie podane polecenie. Nie edytuj ani nie dziel jego URI ani argumentów. 3. Jeśli CLI zacznie czekać na zatwierdzenie, poinstruuj użytkownika, aby wrócił do Starcat. 4. Użytkownik przegląda informacje o urządzeniu i zatwierdza parowanie w Starcat. 5. Po pomyślnym parowaniu uruchom: ```bash starcat doctor ``` 6. Jeśli bieżąca powłoka macOS/Linux nie może znaleźć `starcat`, użyj: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Obsługa błędów ### Wygasłe polecenie Poinstruuj użytkownika, aby wygenerował i skopiował nowy prompt parowania z **Starcat > Ustawienia > MCP Service**. ### Już użyte polecenie Poinstruuj użytkownika, aby wygenerował nowe jednorazowe polecenie parowania. Nie próbuj ponownie użyć już użytego polecenia. ### Parowanie odrzucone przez użytkownika Zatrzymaj się i zgłoś, że urządzenie nie otrzymało dostępu do Starcat. ### Starcat nie jest uruchomione Poinstruuj użytkownika, aby uruchomił Starcat i włączył usługę MCP, a następnie uruchom diagnostykę ponownie. ## Granice bezpieczeństwa - Nie analizuj, nie edytuj ani nie dziel URI parowania. - Nie powtarzaj kompletnego polecenia parowania w odpowiedzi końcowej. - Nie przechowuj polecenia parowania w repozytorium, pliku konfiguracyjnym, notatce ani trwałym dzienniku. - Nie używaj ponownie zakończonego lub wygasłego polecenia parowania. - Nie pytaj o lokalny klucz API. - Nie ręcznie obniżaj punktu końcowego HTTPS do HTTP. - Nie uruchamiaj innych poleceń Starcat przed zakończeniem parowania. ## Raport końcowy Obecny agent AI raportuje: - Czy CLI zaakceptowało polecenie parowania - Czy weszło w etap zatwierdzania Starcat - Czy użytkownik zatwierdził urządzenie - Czy `starcat doctor` jest w dobrym stanie - Wersję CLI, wersję aplikacji i liczbę dostępnych narzędzi Raport końcowy nie może zawierać kompletnego polecenia parowania, URI parowania, sekretu ani innych poświadczeń.
pt_br: # Emparelhar a CLI do Starcat ## Objetivo O Agente de IA atual usa o comando de emparelhamento de uso único completo gerado pelo Starcat e aguarda o usuário aprovar o dispositivo no Starcat. ## Comando de Emparelhamento de Uso Único ```bash %1$@ ``` ## Etapas 1. Confirme que o conteúdo acima é um comando `starcat pair ...` completo. 2. Execute o comando completo exatamente como fornecido. Não edite ou divida seu URI ou argumentos. 3. Se a CLI começar a aguardar aprovação, instrua o usuário a retornar ao Starcat. 4. O usuário revisa as informações do dispositivo e aprova o emparelhamento no Starcat. 5. Após o emparelhamento ser bem-sucedido, execute: ```bash starcat doctor ``` 6. Se o shell atual do macOS/Linux não conseguir encontrar `starcat`, use: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Tratamento de Erros ### Comando expirado Instrua o usuário a gerar e copiar um novo comando de emparelhamento em **Starcat > Ajustes > Serviço MCP**. ### Comando já utilizado Instrua o usuário a gerar um novo comando de emparelhamento de uso único. Não tente novamente um comando já utilizado. ### Emparelhamento rejeitado pelo usuário Pare e informe que o dispositivo não recebeu acesso ao Starcat. ### Starcat não está em execução Instrua o usuário a iniciar o Starcat e ativar o Serviço MCP e, em seguida, execute os diagnósticos novamente. ## Limites de Segurança - Não analise, edite ou divida o URI de emparelhamento. - Não repita o comando de emparelhamento completo na resposta final. - Não armazene o comando de emparelhamento em um repositório, arquivo de configuração, nota ou log persistente. - Não reutilize um comando de emparelhamento concluído ou expirado. - Não solicite uma Chave de API Local. - Não faça downgrade manual de um endpoint HTTPS para HTTP. - Não execute outros comandos do Starcat antes que o emparelhamento seja concluído. ## Relatório Final O Agente de IA atual relata: - Se a CLI aceitou o comando de emparelhamento - Se entrou no estágio de aprovação do Starcat - Se o usuário aprovou o dispositivo - Se `starcat doctor` está íntegro - Versão da CLI, versão do App e contagem de ferramentas disponíveis O relatório final não deve conter o comando de emparelhamento completo, URI de emparelhamento, segredo ou outras credenciais.
ru: # Сопряжение Starcat CLI ## Цель Текущий ИИ-агент использует полную одноразовую команду сопряжения, сгенерированную Starcat, затем ожидает, пока пользователь подтвердит устройство в Starcat. ## Одноразовая команда сопряжения ```bash %1$@ ``` ## Шаги 1. Убедитесь, что содержимое выше является одной полной командой `starcat pair ...`. 2. Выполните полную команду точно так, как предоставлено. Не редактируйте и не разделяйте её URI или аргументы. 3. Если CLI начинает ожидание подтверждения, укажите пользователю вернуться в Starcat. 4. Пользователь просматривает информацию об устройстве и подтверждает сопряжение в Starcat. 5. После успешного сопряжения выполните: ```bash starcat doctor ``` 6. Если текущая оболочка macOS/Linux не может найти `starcat`, используйте: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Обработка ошибок ### Истекшая команда Укажите пользователю сгенерировать и скопировать новый запрос на сопряжение из **Starcat > Настройки > MCP-сервис**. ### Уже использованная команда Укажите пользователю сгенерировать новую одноразовую команду сопряжения. Не повторяйте уже использованную команду. ### Сопряжение отклонено пользователем Остановитесь и сообщите, что устройство не получило доступ к Starcat. ### Starcat не запущен Укажите пользователю запустить Starcat и включить MCP-сервис, затем снова выполните диагностику. ## Границы безопасности - Не разбирайте, не редактируйте и не разделяйте URI сопряжения. - Не повторяйте полную команду сопряжения в итоговом ответе. - Не сохраняйте команду сопряжения в репозитории, файле конфигурации, заметке или постоянном журнале. - Не используйте повторно завершённую или истекшую команду сопряжения. - Не запрашивайте локальный API-ключ. - Не понижайте вручную HTTPS-конечную точку до HTTP. - Не выполняйте другие команды Starcat до завершения сопряжения. ## Итоговый отчёт Текущий ИИ-агент сообщает: - Принял ли CLI команду сопряжения - Перешёл ли он в стадию подтверждения Starcat - Подтвердил ли пользователь устройство - Здоров ли `starcat doctor` - Версия CLI, версия приложения и количество доступных инструментов Итоговый отчёт не должен содержать полную команду сопряжения, URI сопряжения, секрет или другие учётные данные.
tr: # Starcat CLI'yı Eşle ## Hedef Mevcut Yapay Zeka Aracısı, Starcat tarafından oluşturulan tam tek kullanımlık eşleme komutunu kullanır, ardından kullanıcının Starcat'ta cihazı onaylamasını bekler. ## Tek Kullanımlık Eşleme Komutu ```bash %1$@ ``` ## Adımlar 1. Yukarıdaki içeriğin tam bir `starcat pair ...` komutu olduğunu onaylayın. 2. Tam komutu aynen verildiği gibi çalıştırın. URI'sini veya argümanlarını düzenlemeyin veya bölmeyin. 3. CLI onay beklemeye başlarsa, kullanıcıya Starcat'a dönmesini söyleyin. 4. Kullanıcı cihaz bilgilerini inceler ve Starcat'ta eşlemeyi onaylar. 5. Eşleme başarılı olduktan sonra şunu çalıştırın: ```bash starcat doctor ``` 6. Mevcut macOS/Linux kabuğu `starcat`'ı bulamazsa şunu kullanın: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Hata Yönetimi ### Süresi dolmuş komut Kullanıcıya **Starcat > Ayarlar > MCP Servisi**'nden yeni bir eşleme istemi oluşturmasını ve kopyalamasını söyleyin. ### Zaten kullanılmış komut Kullanıcıya yeni bir tek kullanımlık eşleme komutu oluşturmasını söyleyin. Zaten kullanılmış bir komutu tekrar denemeyin. ### Kullanıcı tarafından reddedilen eşleme Durdurun ve cihazın Starcat erişimi almadığını bildirin. ### Starcat çalışmıyor Kullanıcıya Starcat'ı başlatmasını ve MCP Servisini etkinleştirmesini, ardından tanılamayı tekrar çalıştırmasını söyleyin. ## Güvenlik Sınırları - Eşleme URI'sini ayrıştırmayın, düzenlemeyin veya bölmeyin. - Tam eşleme komutunu son yanıtta tekrarlamayın. - Eşleme komutunu bir depoda, yapılandırma dosyasında, notta veya kalıcı günlükte saklamayın. - Tamamlanmış veya süresi dolmuş bir eşleme komutunu yeniden kullanmayın. - Yerel API Anahtarı istemeyin. - Bir HTTPS uç noktasını manuel olarak HTTP'ye düşürmeyin. - Eşleme tamamlanmadan önce başka Starcat komutları çalıştırmayın. ## Son Rapor Mevcut Yapay Zeka Aracısı şunları raporlar: - CLI'nın eşleme komutunu kabul edip etmediği - Starcat onay aşamasına girip girmediği - Kullanıcının cihazı onaylayıp onaylamadığı - `starcat doctor`'ın sağlıklı olup olmadığı - CLI sürümü, Uygulama sürümü ve mevcut araç sayısı Son rapor, tam eşleme komutunu, eşleme URI'sini, sırrı veya diğer kimlik bilgilerini içermemelidir.
uk: # Сполучення Starcat CLI ## Мета Поточний AI-агент використовує повну одноразову команду сполучення, згенеровану Starcat, потім чекає, поки користувач підтвердить пристрій у Starcat. ## Одноразова команда сполучення ```bash %1$@ ``` ## Кроки 1. Підтвердьте, що вміст вище є однією повною командою `starcat pair ...`. 2. Виконайте повну команду точно так, як надано. Не редагуйте та не розділяйте її URI або аргументи. 3. Якщо CLI починає очікувати підтвердження, вкажіть користувачеві повернутися до Starcat. 4. Користувач переглядає інформацію про пристрій і підтверджує сполучення в Starcat. 5. Після успішного сполучення виконайте: ```bash starcat doctor ``` 6. Якщо поточна оболонка macOS/Linux не може знайти `starcat`, використовуйте: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Обробка помилок ### Термін дії команди минув Вкажіть користувачеві згенерувати та скопіювати новий запит на сполучення з **Starcat > Налаштування > MCP Service**. ### Вже використана команда Вкажіть користувачеві згенерувати нову одноразову команду сполучення. Не повторюйте вже використану команду. ### Сполучення відхилено користувачем Зупиніться та повідомте, що пристрій не отримав доступ до Starcat. ### Starcat не запущено Вкажіть користувачеві запустити Starcat та увімкнути MCP-сервіс, потім виконайте діагностику знову. ## Межі безпеки - Не аналізуйте, не редагуйте та не розділяйте URI сполучення. - Не повторюйте повну команду сполучення у підсумковій відповіді. - Не зберігайте команду сполучення в репозиторії, файлі конфігурації, нотатці або постійному журналі. - Не використовуйте повторно завершену або прострочену команду сполучення. - Не запитуйте локальний API-ключ. - Не знижуйте вручну HTTPS-кінцеву точку до HTTP. - Не виконуйте інші команди Starcat до завершення сполучення. ## Підсумковий звіт Поточний AI-агент повідомляє: - Чи прийняв CLI команду сполучення - Чи перейшов він у стадію підтвердження Starcat - Чи підтвердив користувач пристрій - Чи справний `starcat doctor` - Версію CLI, версію додатка та кількість доступних інструментів Підсумковий звіт не повинен містити повну команду сполучення, URI сполучення, секрет або інші облікові дані.
vi: # Ghép nối Starcat CLI ## Mục tiêu Tác nhân AI hiện tại sử dụng lệnh ghép nối dùng một lần hoàn chỉnh do Starcat tạo, sau đó chờ người dùng phê duyệt thiết bị trong Starcat. ## Lệnh ghép nối dùng một lần ```bash %1$@ ``` ## Các bước 1. Xác nhận rằng nội dung trên là một lệnh `starcat pair ...` hoàn chỉnh. 2. Thực thi lệnh hoàn chỉnh chính xác như được cung cấp. Không chỉnh sửa hoặc tách URI hoặc đối số của nó. 3. Nếu CLI bắt đầu chờ phê duyệt, hãy hướng dẫn người dùng quay lại Starcat. 4. Người dùng xem xét thông tin thiết bị và phê duyệt ghép nối trong Starcat. 5. Sau khi ghép nối thành công, chạy: ```bash starcat doctor ``` 6. Nếu shell macOS/Linux hiện tại không tìm thấy `starcat`, hãy dùng: ```bash "$HOME/.local/bin/starcat" doctor ``` ## Xử lý lỗi ### Lệnh hết hạn Hướng dẫn người dùng tạo và sao chép lời nhắc ghép nối mới từ **Starcat > Cài đặt > Dịch vụ MCP**. ### Lệnh đã được sử dụng Hướng dẫn người dùng tạo lệnh ghép nối dùng một lần mới. Không thử lại lệnh đã được sử dụng. ### Ghép nối bị người dùng từ chối Dừng và báo cáo rằng thiết bị không nhận được quyền truy cập Starcat. ### Starcat không chạy Hướng dẫn người dùng khởi chạy Starcat và bật dịch vụ MCP, sau đó chạy lại chẩn đoán. ## Ranh giới bảo mật - Không phân tích cú pháp, chỉnh sửa hoặc tách URI ghép nối. - Không lặp lại lệnh ghép nối hoàn chỉnh trong phản hồi cuối cùng. - Không lưu trữ lệnh ghép nối trong kho lưu trữ, tệp cấu hình, ghi chú hoặc nhật ký liên tục. - Không sử dụng lại lệnh ghép nối đã hoàn thành hoặc hết hạn. - Không yêu cầu Khóa API cục bộ. - Không tự ý hạ cấp điểm cuối HTTPS xuống HTTP. - Không chạy các lệnh Starcat khác trước khi ghép nối hoàn tất. ## Báo cáo cuối cùng Tác nhân AI hiện tại báo cáo: - CLI có chấp nhận lệnh ghép nối không - Có vào giai đoạn phê duyệt Starcat không - Người dùng có phê duyệt thiết bị không - `starcat doctor` có lành mạnh không - Phiên bản CLI, phiên bản ứng dụng và số lượng công cụ khả dụng Báo cáo cuối cùng không được chứa lệnh ghép nối hoàn chỉnh, URI ghép nối, bí mật hoặc thông tin xác thực khác.
zh_hans: # 配对 Starcat CLI ## 任务目标 当前 AI Agent 使用 Starcat 生成的完整一次性配对命令连接 CLI，并等待用户在 Starcat 中确认设备。 ## 一次性配对命令 ```bash %1$@ ``` ## 执行步骤 1. 确认上方内容是一条完整的 `starcat pair ...` 命令。 2. 原样执行完整命令，不修改、不拆分其中的 URI 或参数。 3. 如果 CLI 进入等待确认状态，提示用户返回 Starcat。 4. 用户在 Starcat 中核对设备信息并确认配对。 5. 配对成功后运行： ```bash starcat doctor ``` 6. 如果当前 macOS/Linux shell 找不到 `starcat`，改用： ```bash "$HOME/.local/bin/starcat" doctor ``` ## 异常处理 ### 配对命令已过期 提示用户在 Starcat 的「设置 → MCP Service」中重新生成并复制新的配对提示词。 ### 配对命令已使用 提示用户重新生成一次性配对命令。不要重复执行已经使用过的命令。 ### 用户拒绝配对 停止后续操作，并报告设备未获得 Starcat 访问权限。 ### Starcat 未运行 提示用户启动 Starcat，并确认 MCP Service 已开启，然后重新执行诊断。 ## 安全限制 - 不解析、修改或拆分配对 URI。 - 不在最终回复中复述完整配对命令。 - 不把配对命令写入仓库、配置文件、笔记或长期日志。 - 不重复使用已经完成或失效的配对命令。 - 不向用户索取 Local API Key。 - 不把 HTTPS endpoint 手工降级为 HTTP。 - 配对完成前不执行其他 Starcat 命令。 ## 完成后报告 当前 AI Agent 最终报告： - 配对命令是否被 CLI 接受 - 是否进入 Starcat 确认阶段 - 用户是否完成确认 - `starcat doctor` 是否健康 - CLI 版本、App 版本和可用工具数量 最终报告不得包含完整配对命令、pairing URI、secret 或其他凭据。
zh_hant: # 配對 Starcat CLI ## 目標 目前 AI Agent 使用 Starcat 產生的完整一次性配對命令，然後等待使用者在 Starcat 中確認裝置。 ## 一次性配對命令 ```bash %1$@ ``` ## 步驟 1. 確認上方內容是一條完整的 `starcat pair ...` 命令。 2. 原樣執行完整命令，不要編輯或拆分其中的 URI 或引數。 3. 如果 CLI 開始等待確認，請指示使用者返回 Starcat。 4. 使用者在 Starcat 中檢視裝置資訊並核准配對。 5. 配對成功後執行： ```bash starcat doctor ``` 6. 如果目前 macOS/Linux shell 找不到 `starcat`，請改用： ```bash "$HOME/.local/bin/starcat" doctor ``` ## 錯誤處理 ### 命令已過期 指示使用者從 **Starcat > 設定 > MCP Service** 產生並複製新的配對提示。 ### 命令已使用 指示使用者產生新的一次性配對命令。不要重試已使用的命令。 ### 配對被使用者拒絕 停止並回報裝置未獲得 Starcat 存取權。 ### Starcat 未執行 指示使用者啟動 Starcat 並啟用 MCP Service，然後再次執行診斷。 ## 安全邊界 - 不要解析、編輯或拆分配對 URI。 - 不要在最終回應中重複完整配對命令。 - 不要將配對命令儲存在儲存庫、設定檔、筆記或持久日誌中。 - 不要重複使用已完成或已過期的配對命令。 - 不要要求 Local API Key。 - 不要手動將 HTTPS 端點降級為 HTTP。 - 在配對完成前不要執行其他 Starcat 命令。 ## 最終報告 目前 AI Agent 報告： - CLI 是否接受配對命令 - 是否進入 Starcat 核准階段 - 使用者是否核准裝置 - `starcat doctor` 是否健康 - CLI 版本、App 版本及可用工具數量 最終報告不得包含完整配對命令、配對 URI、密碼或其他憑證。
